emacs/doom/user/README.org
#+TITLE: Doom Emacs Config
#+PROPERTY: header-args :tangle config.el
* Table of Contents :toc:
- [[#about-this-config][About This Config]]
- [[#personal-info][Personal Info]]
  - [[#name-and-email][Name and Email]]
  - [[#project-folders][Project Folders]]
- [[#personal-preferences][Personal Preferences]]
  - [[#splash-image][Splash image]]
  - [[#theme][Theme]]
  - [[#custom-themes][Custom Themes]]
  - [[#circadian-themes][Circadian Themes]]
  - [[#fonts][Fonts]]
  - [[#modeline][Modeline]]
  - [[#modeline-height][Modeline height]]
  - [[#beacon-mode][Beacon mode]]
  - [[#minimap][Minimap]]
  - [[#comments][Comments]]
  - [[#line-numbers][Line numbers]]
  - [[#start-window-dimensions][Start Window Dimensions]]
  - [[#transparency][Transparency]]
  - [[#some-window-decorators][Some window decorators]]
- [[#ruby-version-managers][Ruby Version Managers]]
  - [[#if-you-use-macos-with-rbenv-on-homebrew-add-it-uncomment-it][If you use macos with rbenv on homebrew, add it, uncomment it]]
  - [[#using-asdf][Using ASDF]]
- [[#pixel-scrolling-precision-mode][Pixel Scrolling Precision Mode]]
- [[#abbrev-mode][Abbrev Mode]]
- [[#narrowing-and-center-buffer-contents][Narrowing and center buffer contents]]
- [[#git-gutter][Git gutter]]
- [[#editing-configurations][Editing configurations]]
  - [[#evil][Evil]]
  - [[#completions][Completions]]
  - [[#smaller-popup-text][Smaller popup text]]
  - [[#corfu-yasnippet][Corfu-Yasnippet]]
  - [[#language-server-protocol-lsp][Language server protocol (lsp)]]
  - [[#yasnippet][Yasnippet]]
- [[#key-chords][Key Chords]]
- [[#terminal-management][Terminal Management]]
- [[#harpoon][Harpoon]]
- [[#search][Search]]
  - [[#ignoring-some-folders-on-search][Ignoring some folders on search]]
  - [[#custom-searches][Custom Searches]]
- [[#indentation][Indentation]]
- [[#google-traductor][Google Traductor]]
- [[#rubocop][Rubocop]]
  - [[#rubocop-on-current-file-command][Rubocop on current file command]]
  - [[#disable-rubocop][Disable Rubocop]]
- [[#eglot][Eglot]]
- [[#rustic][Rustic]]
- [[#lsp-mode][LSP Mode]]
- [[#minites-or-rspec][Minites or RSpec]]
- [[#solargraph-or-sorbet][Solargraph or Sorbet]]
- [[#warnings-level][Warnings level]]
- [[#projectile-magit][Projectile Magit]]
- [[#docker][Docker]]
  - [[#want-to-use-docker][Want to use DOCKER?]]
  - [[#ruby-and-docker][Ruby and Docker]]
  - [[#javascript][Javascript]]
- [[#dired-and-peep-dired][Dired and Peep Dired]]
  - [[#dired-mode-map][Dired mode map]]
  - [[#icons-in-dired][Icons in Dired]]
  - [[#peep-dired-mode-map][Peep dired mode map]]
- [[#org][ORG]]
  - [[#org-file-location][Org file location]]
  - [[#custom-faces][Custom faces]]
  - [[#org-pretty-bullets][Org pretty bullets]]
  - [[#turn-off-highlighting-current-line][Turn off highlighting current line]]
  - [[#org-modern][Org-modern]]
  - [[#org-appear][Org-appear]]
- [[#org-roam][Org-Roam]]
  - [[#install][Install]]
  - [[#roamnotes-directory---avoid-showing-title-in-window][RoamNotes Directory - Avoid showing title in window]]
  - [[#websocket][Websocket]]
  - [[#org-roam-ui][Org-Roam UI]]
  - [[#svg-tag-mode][Svg-Tag-Mode]]
  - [[#fix-svg-tags-cannot-render-in-agenda][Fix SVG tags cannot render in agenda]]
  - [[#toc-org][TOC org]]

* About This Config
This configuration works with Emacs 29.1, you'll need to install Doom Emacs, and Doom Emacs on Rails.

* Personal Info
** Name and Email
Set your name and email
#+begin_src emacs-lisp
(setq user-full-name "Alan Maciel"
      user-mail-address "alan.maciel.salcedo@gmail.com")
#+end_src

** Project Folders
MOST IMPORTANT CONFIG - Set your project folders
#+begin_src emacs-lisp
(setq projectile-project-search-path '("~/Projects" "~/Study"))
#+end_src

* Personal Preferences
** Splash image
Change splash image.
#+begin_src emacs-lisp
;; (setq dashboard-startup-banner nil)
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-banner)
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-footer)
;; (remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
;; (setq fancy-splash-image (concat doom-private-dir "splash.png"))
;; (setq fancy-splash-image "~/dotfiles-local/emacs/doom.d/splash/emacs.png")
;; (setq fancy-splash-image "~/dotfiles-local/emacs/doom.d/splash/lucky-doom-emacs-color.png")
;; (setq fancy-splash-image "~/dotfiles-local/emacs/doom.d/splash/fa1983dd4f50bb1b12eb3ada8f020a2e.png")
;; (setq fancy-splash-image "~/dotfiles-local/emacs/doom.d/splash/eeb1668a976d83fcb0543ca55dc87be0.png")
;; (setq fancy-splash-image "~/dotfiles-local/emacs/doom.d/splash/e6d42358cc42033ae34b07cb90bc46d2.png")
;; (setq fancy-splash-image "~/dotfiles-local/emacs/doom.d/splash/81558554-cbf53680-9385-11ea-8db6-2dc6abe0c1ae.png")
#+end_src

** Theme
Set your Theme.
#+begin_src emacs-lisp
(setq doom-theme 'doom-wilmersdorf
      doom-themes-treemacs-enable-variable-pitch nil)
;; (setq doom-theme 'doom-gruvbox
;;       doom-themes-treemacs-enable-variable-pitch nil)
;; spacemacs-light, doom-nord-light, doom-gruvbox-light,
;; (setq doom-theme 'doom-oceanic-next
;;        doom-themes-treemacs-enable-variable-pitch nil)
;; (setq doom-theme 'doom-nord-light
;;        doom-themes-treemacs-enable-variable-pitch nil)
;; (setq doom-theme 'doom-tokyo-night
;;        doom-themes-treemacs-enable-variable-pitch nil)
;; (setq doom-theme 'jetbrains-darcula
;;        doom-themes-treemacs-enable-variable-pitch nil)
;;(setq doom-theme 'doom-zenburn
;;        doom-themes-treemacs-enable-variable-pitch nil)
#+end_src

** Custom Themes
If you want to load a custom theme.
#+begin_src emacs-lisp
;; (add-to-list 'custom-theme-load-path "~/.emacs.d/themes/")
;; (load-theme 'twilight t)
;; (setq doom-theme 'twilight)
#+end_src

** Circadian Themes
Add Circadian to change themes depending the time of the day.
#+begin_src emacs-lisp
;; For day:
;; spacemacs-light, doom-nord-light, doom-gruvbox-light,
;; For night:
;; doom-dracula, doom-gruvbox, doom-sourcerer, doom-spacegray, doom-vibrant
;; doom-oceanic-next, doom-laserwave
;; (defun y/auto-update-theme ()
;;   "depending on time use different theme"
;;   ;; very early => gruvbox-light, solarized-light, nord-light
;;   (let* ((hour (nth 2 (decode-time (current-time))))
;;          (theme (cond ((<= 7 hour 8)   'doom-gruvbox-light)
;;                       ((= 9 hour)      'spacemacs-light)
;;                       ((<= 10 hour 16) 'doom-nord-light)
;;                       ((<= 17 hour 18) 'doom-gruvbox-light)
;;                       ((<= 19 hour 22) 'doom-oceanic-next)
;;                       (t               'doom-laserwave))))
;;     (when (not (equal doom-theme theme))
;;       (setq doom-theme theme)
;;       (load-theme doom-theme t))
;;     ;; run that function again next hour
;;     (run-at-time (format "%02d:%02d" (+ hour 1) 0) nil 'y/auto-update-theme)))
#+end_src

** Fonts
My recommendation is JetBrains Mono.  Use M-x reload-user-settings to see the font change.
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "Menlo" :size 12 :weight 'regular) ;; You can change to regular if you prefer
      doom-big-font (font-spec :family "Operator Mono" :size 18)
      doom-variable-pitch-font (font-spec :family "Overpass" :size 12)
      doom-unicode-font (font-spec :family "JetBrainsMono Nerd Font" :size 11)
      doom-serif-font (font-spec :family "IBM Plex Mono" :weight 'light))

;; (setq doom-font (font-spec :family "JetBrains Mono" :size 13 :weight 'bold) ;; You can change to regular if you prefer
;;       doom-big-font (font-spec :family "Operator Mono" :size 18)
;;       doom-variable-pitch-font (font-spec :family "Overpass" :size 12)
;;       doom-unicode-font (font-spec :family "JetBrainsMono Nerd Font" :size 11)
;;       doom-serif-font (font-spec :family "IBM Plex Mono" :weight 'light))

;; (setq doom-font (font-spec :family "Operator Mono" :size 13) ;; You can change to regular if you prefer
;;       doom-variable-pitch-font (font-spec :family "JetBrains Mono" :size 13)
;;       doom-variable-pitch-font (font-spec :family "Overpass" :size 12)
;;       doom-unicode-font (font-spec :family "JetBrainsMono Nerd Font" :size 11)
;;       doom-serif-font (font-spec :family "IBM Plex Mono" :weight 'light))

;; (when (doom-font-exists-p "Iosevka Custom")
;;     (setq doom-font                (font-spec :name "Iosevka Custom" :size 14)))
;; (when (doom-font-exists-p "Alegreya Sans")
;;     (setq doom-variable-pitch-font (font-spec :name "Alegreya Sans"  :size 16)))
;; (when (doom-font-exists-p "Noto Color Emoji")
;;     (setq doom-unicode-font        (font-spec :name "Noto Color Emoji")))
#+end_src

** Modeline
#+begin_src emacs-lisp
(use-package! doom-modeline
  :config
  (setq doom-modeline-persp-name t))
#+end_src

** Modeline height
Some tweaks to doom-modeline:
#+begin_src emacs-lisp
(setq doom-modeline-height 35)
#+end_src

** Beacon mode
Highlight the current line when moving.
#+begin_src emacs-lisp
(beacon-mode 1)
#+end_src

** Minimap
If you like this type of things.
#+begin_src emacs-lisp
(setq minimap-window-location 'right)
(map! :leader
      (:prefix ("t" . "toggle")
       :desc "Toggle minimap-mode" "M" #'minimap-mode))
#+end_src

** Comments
I like to see comments in italics.
#+begin_src emacs-lisp
(custom-set-faces!
  '(font-lock-comment-face :slant italic))
#+end_src

** Line numbers
How do you want to display line numbers? t, nil, or relative?
#+begin_src emacs-lisp
(setq display-line-numbers-type t)
#+end_src

** Start Window Dimensions
Start the initial frame not maximized
#+begin_src emacs-lisp
(setq default-frame-alist '((width . 115)(height . 34)))
;; (add-to-list 'initial-frame-alist '(width . 92))
;; (add-to-list 'initial-frame-alist '(height . 40))
#+end_src

Start every frame not maximized
#+begin_src emacs-lisp
;; (add-to-list 'default-frame-alist '(width . 92))
;; (add-to-list 'default-frame-alist '(height . 40))
#+end_src

** Transparency
#+begin_src emacs-lisp
; (add-to-list 'default-frame-alist '(alpha-background . 50))
(add-to-list 'default-frame-alist '(alpha . 95))
#+end_src

