emacs/doom/user/config.el
(setq user-full-name "Alan Maciel"
      user-mail-address "alan.maciel.salcedo@gmail.com")

(setq projectile-project-search-path '("~/Projects" "~/Study"))

;; (setq dashboard-startup-banner nil)
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-banner)
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-footer)
;; (remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
;; (setq fancy-splash-image (concat doom-private-dir "splash.png"))
;; (setq fancy-splash-image "~/dotfiles-local/emacs/doom.d/splash/emacs.png")
;; (setq fancy-splash-image "~/dotfiles-local/emacs/doom.d/splash/lucky-doom-emacs-color.png")
;; (setq fancy-splash-image "~/dotfiles-local/emacs/doom.d/splash/fa1983dd4f50bb1b12eb3ada8f020a2e.png")
;; (setq fancy-splash-image "~/dotfiles-local/emacs/doom.d/splash/eeb1668a976d83fcb0543ca55dc87be0.png")
;; (setq fancy-splash-image "~/dotfiles-local/emacs/doom.d/splash/e6d42358cc42033ae34b07cb90bc46d2.png")
;; (setq fancy-splash-image "~/dotfiles-local/emacs/doom.d/splash/81558554-cbf53680-9385-11ea-8db6-2dc6abe0c1ae.png")

(setq doom-theme 'doom-wilmersdorf
      doom-themes-treemacs-enable-variable-pitch nil)
;; (setq doom-theme 'doom-gruvbox
;;       doom-themes-treemacs-enable-variable-pitch nil)
;; spacemacs-light, doom-nord-light, doom-gruvbox-light,
;; (setq doom-theme 'doom-oceanic-next
;;        doom-themes-treemacs-enable-variable-pitch nil)
;; (setq doom-theme 'doom-nord-light
;;        doom-themes-treemacs-enable-variable-pitch nil)
;; (setq doom-theme 'doom-tokyo-night
;;        doom-themes-treemacs-enable-variable-pitch nil)
;; (setq doom-theme 'jetbrains-darcula
;;        doom-themes-treemacs-enable-variable-pitch nil)
;;(setq doom-theme 'doom-zenburn
;;        doom-themes-treemacs-enable-variable-pitch nil)

;; (add-to-list 'custom-theme-load-path "~/.emacs.d/themes/")
;; (load-theme 'twilight t)
;; (setq doom-theme 'twilight)

;; For day:
;; spacemacs-light, doom-nord-light, doom-gruvbox-light,
;; For night:
;; doom-dracula, doom-gruvbox, doom-sourcerer, doom-spacegray, doom-vibrant
;; doom-oceanic-next, doom-laserwave
;; (defun y/auto-update-theme ()
;;   "depending on time use different theme"
;;   ;; very early => gruvbox-light, solarized-light, nord-light
;;   (let* ((hour (nth 2 (decode-time (current-time))))
;;          (theme (cond ((<= 7 hour 8)   'doom-gruvbox-light)
;;                       ((= 9 hour)      'spacemacs-light)
;;                       ((<= 10 hour 16) 'doom-nord-light)
;;                       ((<= 17 hour 18) 'doom-gruvbox-light)
;;                       ((<= 19 hour 22) 'doom-oceanic-next)
;;                       (t               'doom-laserwave))))
;;     (when (not (equal doom-theme theme))
;;       (setq doom-theme theme)
;;       (load-theme doom-theme t))
;;     ;; run that function again next hour
;;     (run-at-time (format "%02d:%02d" (+ hour 1) 0) nil 'y/auto-update-theme)))

(setq doom-font (font-spec :family "Menlo" :size 12 :weight 'regular) ;; You can change to regular if you prefer
      doom-big-font (font-spec :family "Operator Mono" :size 18)
      doom-variable-pitch-font (font-spec :family "Overpass" :size 12)
      doom-unicode-font (font-spec :family "JetBrainsMono Nerd Font" :size 11)
      doom-serif-font (font-spec :family "IBM Plex Mono" :weight 'light))

;; (setq doom-font (font-spec :family "JetBrains Mono" :size 13 :weight 'bold) ;; You can change to regular if you prefer
;;       doom-big-font (font-spec :family "Operator Mono" :size 18)
;;       doom-variable-pitch-font (font-spec :family "Overpass" :size 12)
;;       doom-unicode-font (font-spec :family "JetBrainsMono Nerd Font" :size 11)
;;       doom-serif-font (font-spec :family "IBM Plex Mono" :weight 'light))

;; (setq doom-font (font-spec :family "Operator Mono" :size 13) ;; You can change to regular if you prefer
;;       doom-variable-pitch-font (font-spec :family "JetBrains Mono" :size 13)
;;       doom-variable-pitch-font (font-spec :family "Overpass" :size 12)
;;       doom-unicode-font (font-spec :family "JetBrainsMono Nerd Font" :size 11)
;;       doom-serif-font (font-spec :family "IBM Plex Mono" :weight 'light))

;; (when (doom-font-exists-p "Iosevka Custom")
;;     (setq doom-font                (font-spec :name "Iosevka Custom" :size 14)))
;; (when (doom-font-exists-p "Alegreya Sans")
;;     (setq doom-variable-pitch-font (font-spec :name "Alegreya Sans"  :size 16)))
;; (when (doom-font-exists-p "Noto Color Emoji")
;;     (setq doom-unicode-font        (font-spec :name "Noto Color Emoji")))

(use-package! doom-modeline
  :config
  (setq doom-modeline-persp-name t))

(setq doom-modeline-height 35)

(beacon-mode 1)

(setq minimap-window-location 'right)
(map! :leader
      (:prefix ("t" . "toggle")
       :desc "Toggle minimap-mode" "M" #'minimap-mode))

(custom-set-faces!
  '(font-lock-comment-face :slant italic))

(setq display-line-numbers-type t)

(setq default-frame-alist '((width . 115)(height . 34)))
;; (add-to-list 'initial-frame-alist '(width . 92))
;; (add-to-list 'initial-frame-alist '(height . 40))

;; (add-to-list 'default-frame-alist '(width . 92))
;; (add-to-list 'default-frame-alist '(height . 40))

; (add-to-list 'default-frame-alist '(alpha-background . 50))
(add-to-list 'default-frame-alist '(alpha . 95))
