emacs/doom/user/README.org
** Some window decorators
#+begin_src emacs-lisp
;; (add-to-list 'default-frame-alist '(undecorated-round . t))
;; (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
;; (add-to-list 'default-frame-alist '(ns-appearance . dark))
;; (add-to-list 'default-frame-alist '(undecorated . t))
;; (add-to-list 'default-frame-alist '(drag-internal-border . 1))
;; (add-to-list 'default-frame-alist '(internal-border-width . 5))
;; (if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
;; (if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
;; (if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
(add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
(add-to-list 'default-frame-alist '(ns-appearance . dark))
#+end_src

* Ruby Version Managers
** If you use macos with rbenv on homebrew, add it, uncomment it
#+begin_src emacs-lisp
;; (setq rbenv-executable "/usr/local/opt/rbenv/bin/rbenv") ;; Rosetta (intel emulation)
;; (setq rbenv-executable "/opt/homebrew/bin/rbenv") ;; Arm (normal brew)
#+end_src

** Using ASDF
ASDF instead of rbenv.
#+begin_src emacs-lisp
;; (require 'asdf-vm)
;; (asdf-vm-init)
#+end_src

* Pixel Scrolling Precision Mode
Turn on pixel scrolling (Emacs 29.1).
#+begin_src emacs-lisp
(pixel-scroll-precision-mode nil)
#+end_src

* Abbrev Mode
Turn on abbrev mode
#+begin_src emacs-lisp
(setq-default abbrev-mode t)
#+end_src

* Narrowing and center buffer contents
On larger screens I like buffer contents to not exceed a certain width and are centered. `olivetti-mode` solves this problem nicely. There is also an `auto-olivetti-mode` which automatically turns on olivetti-mode in most buffers.
#+begin_src emacs-lisp
;; (use-package! olivetti
;;  :config
;;  (setq-default olivetti-body-width 130)
;;  (add-hook 'mixed-pitch-mode-hook  (lambda () (setq-local olivetti-body-width 70))))

;; (use-package! auto-olivetti
;;  :custom
;;  (auto-olivetti-enabled-modes '(text-mode prog-mode helpful-mode))
;;  :config
;;  (auto-olivetti-mode))
#+end_src

* Git gutter
The diff changes are reflected in the left fringe. However, I find them to be a little bit too intrusive, so let’s change how they looks by blending the colors into the background a little bit.
#+begin_src emacs-lisp
(use-package! diff-hl
  :config
  (custom-set-faces!
    `((diff-hl-change)
      :foreground ,(doom-blend (doom-color 'bg) (doom-color 'blue) 0.5))
    `((diff-hl-insert)
      :foreground ,(doom-blend (doom-color 'bg) (doom-color 'green) 0.5)))
)
#+end_src

* Editing configurations
** Evil
#+begin_src emacs-lisp
(use-package! evil-escape
  :config
  (setq evil-esc-delay 0.25))

(use-package! evil-vimish-fold
  :config
  (global-evil-vimish-fold-mode))

(use-package! evil-goggles
  :init
  (setq evil-goggles-enable-change t
        evil-goggles-enable-delete t
        evil-goggles-pulse         t
        evil-goggles-duration      0.25)
  :config
  (custom-set-faces!
    `((evil-goggles-yank-face evil-goggles-surround-face)
      :background ,(doom-blend (doom-color 'blue) (doom-color 'bg-alt) 0.5)
      :extend t)
    `(evil-goggles-paste-face
      :background ,(doom-blend (doom-color 'green) (doom-color 'bg-alt) 0.5)
      :extend t)
    `(evil-goggles-delete-face
      :background ,(doom-blend (doom-color 'red) (doom-color 'bg-alt) 0.5)
      :extend t)
    `(evil-goggles-change-face
      :background ,(doom-blend (doom-color 'orange) (doom-color 'bg-alt) 0.5)
      :extend t)
    `(evil-goggles-commentary-face
      :background ,(doom-blend (doom-color 'grey) (doom-color 'bg-alt) 0.5)
      :extend t)
    `((evil-goggles-indent-face evil-goggles-join-face evil-goggles-shift-face)
      :background ,(doom-blend (doom-color 'yellow) (doom-color 'bg-alt) 0.25)
      :extend t)
    ))
#+end_src

** Completions
*** Corfu
Corfu defaults.
#+begin_src emacs-lisp
(setq corfu-auto-delay 0.5)
#+end_src

Enable corfu in the minibuffer.
#+begin_src emacs-lisp
(use-package! corfu
  :config
  (defun corfu-enable-in-minibuffer ()
    "Enable Corfu in the minibuffer if `completion-at-point' is bound."
    (when (where-is-internal #'completion-at-point (list (current-local-map)))
      ;; (setq-local corfu-auto nil) ;; Enable/disable auto completion
      (setq-local corfu-echo-delay nil ;; Disable automatic echo and popup
                  corfu-popupinfo-delay nil)
      (corfu-mode 1)))
  (add-hook 'minibuffer-setup-hook #'corfu-enable-in-minibuffer))
#+end_src

*** Orderless
Set orderless matching styles to include char-fold-to-regexp.
#+begin_src emacs-lisp
(use-package! orderless
  :config
  (add-to-list 'orderless-matching-styles 'char-fold-to-regexp))
#+end_src

** Smaller popup text
Automatic documentation popup while autocompleting is nice, but let’s reduce the font size a little bit so that it doesn’t cover the screen too much and makes it easier to skim for information.
#+begin_src emacs-lisp
(custom-set-faces! '((corfu-popupinfo) :height 0.9))
#+end_src

** Corfu-Yasnippet
Suggest yasnippet as completion.
#+begin_src emacs-lisp
;; (use-package! cape-yasnippet
;;   :after (corfu yasnippet)
;;   :init
;;   (add-to-list 'completion-at-point-functions #'cape-yasnippet))
#+end_src

** Language server protocol (lsp)
#+begin_src emacs-lisp
(use-package! lsp-ui
  :config
  (setq lsp-ui-doc-delay 2
        lsp-ui-doc-max-width 80)
  (setq lsp-signature-function 'lsp-signature-posframe))
#+end_src

** Yasnippet
#+begin_src emacs-lisp
(use-package! yasnippet
  :config
  ;; It will test whether it can expand, if yes, change cursor color
  (defun hp/change-cursor-color-if-yasnippet-can-fire (&optional field)
    (interactive)
    (setq yas--condition-cache-timestamp (current-time))
    (let (templates-and-pos)
      (unless (and yas-expand-only-for-last-commands
                   (not (member last-command yas-expand-only-for-last-commands)))
        (setq templates-and-pos (if field
                                    (save-restriction
                                      (narrow-to-region (yas--field-start field)
                                                        (yas--field-end field))
                                      (yas--templates-for-key-at-point))
                                  (yas--templates-for-key-at-point))))
      (set-cursor-color (if (and templates-and-pos (first templates-and-pos)
                                 (eq evil-state 'insert))
                            (doom-color 'red)
                          (face-attribute 'default :foreground)))))
  :hook (post-command . hp/change-cursor-color-if-yasnippet-can-fire))
#+end_src

* Key Chords
Using chords fd or jh in the homerow instead of trying to reach esc everytime.
#+begin_src emacs-lisp
(require 'key-chord)
(key-chord-mode t)
(key-chord-define-global "ue" 'evil-normal-state) ;; in DVORAK
(key-chord-define-global "UE" 'evil-normal-state) ;; in DVORAK
(key-chord-define-global "fd" 'evil-normal-state) ;; in QWERTY
(key-chord-define-global "FD" 'evil-normal-state) ;; in QWERTY
#+end_src

* Terminal Management
Predefined commands
You can switch to any terminal with SPC l
You can search the commands with SPC o t
You can send any text to any terminal by selecting and pressing SPC l
You can quickly execute a define command with SPC j + the keybinding you defined.

#+begin_src emacs-lisp
(require 'which-key)
(which-key-mode)
;; (which-key-setup-side-window-bottom)
(after! which-key
  ;;                         | Name              | command                      | Keybinding |
  (+add-command-to-term-list '("Docker Compose" . "docker-compose up") "u") ;; SPC j u

  ;; Example asking something
  (+add-command-to-term-list '("Add Yarn Package" . (concat "yarn add " (read-string "Package name: "))) "ya") ;; SPC j y a

  ;; Example of dynamic command (using buffer name as example)
  (+add-command-to-term-list '("Rspec on file" . (concat "bundle exec rspec " (buffer-file-name))) "sv") ;; SPC j s v
  (+add-command-to-term-list '("Rspec on line" . (concat "bundle exec rspec " (buffer-file-name) ":" (format "%s" (line-number-at-pos)))) "ss") ;; SPC j s s

  ;; Getting text and executing a command
  (+add-command-to-term-list '("Brownie Test" . (concat "brownie test -k " (save-excursion (search-backward "def test_") (forward-word 2) (thing-at-point 'symbol t)))) "bt") ;; SPC j b t

  ;; Running scripts of a specific folder
  (+add-command-to-term-list '("Brownie Run Script" . (concat "brownie run " (read-file-name "scripts/") " " (read-string "Extra parameters: " nil "commands"))) "br") ;; SPC j b r

  ;; Creating terminal layouts: SPC T
  ;; It will create a new workspace with all terminals listed
  ;;                         | Layout Name    | Commands to execute                |
  (+add-layout-to-term-list '("Rails" . '("rails console" "rails server" nil)))
  (+add-layout-to-term-list '("React" . '("yarn start" nil)))
  (+add-layout-to-term-list '("Next JS" . '("yarn dev" "cowsay 'Have an nice work'" nil)))
  )
#+end_src

* Harpoon
Harpoon separate by branch? (Harpoon leader key: ,)
#+begin_src emacs-lisp
(setq harpoon-separate-by-branch nil)
#+end_src

* Search
