emacs/doom/user/README.org
** Ignoring some folders on search
#+begin_src emacs-lisp
(after! projectile
  (setq projectile-globally-ignored-directories '("flow-typed" "node_modules" "~/.config/emacs/.local/" ".idea" ".vscode" ".ensime_cache" ".eunit" ".git" ".hg" ".fslckout" "_FOSSIL_" ".bzr" "_darcs" ".tox" ".svn" ".stack-work" ".ccls-cache" ".cache" ".clangd")))
#+end_src

** Custom Searches
Add your custom searches (in rails folders)
#+begin_src emacs-lisp
(after! projectile-rails
  (doom-emacs-on-rails-add-custom-projectile-finder "services" "app/services/"  "\\(.+\\)\\.rb$" "app/services/${filename}.rb" "rt")
  (doom-emacs-on-rails-add-custom-projectile-finder "admin" "app/admin/"  "\\(.+\\)\\.rb$" "app/admin/${filename}.rb" "rt")
  (doom-emacs-on-rails-add-custom-projectile-finder "contracts" "app/contracts/"  "\\(.+\\)\\.rb$" "app/contracts/${filename}.rb" "rq"))
#+end_src

* Indentation
Fix your identation level for stuff?
#+begin_src emacs-lisp
(setq js-indent-level 2)
(setq ts-indent-level 2)
(setq typescript-indent-level 2)
(setq ruby-indent-level 2)
(setq standard-indent 2)
#+end_src

* Google Traductor
Google Traductor, source and target languages
#+begin_src emacs-lisp
(setq google-translate-default-source-language "en")
(setq google-translate-default-target-language "es-MX")
#+end_src

* Rubocop
** Rubocop on current file command
#+begin_src emacs-lisp
;; (setq rubocop-on-current-file-command "bundle exec rubocop -A ") ;; SPC =
#+end_src

** Disable Rubocop
Disable Rubocop or any other lint if you want.  Linter list on: SPC h v flycheck-checkers
#+begin_src emacs-lisp
;; (add-hook 'ruby-mode-hook
;;  (lambda ()
;;    (setq-local flychech-checker nil)
;;    (setq-local flycheck-disabled-checkers '(ruby-reek lsp ruby-rubylint ruby-rubocop))) 1000)
#+end_src

* Eglot
#+begin_src emacs-lisp
(use-package eglot
  :config
  (setq eglot-events-buffer-size 0
        eglot-ignored-server-capabilities '(:inlayHintProvider)
        eglot-confirm-server-initiated-edits nil))
#+end_src

* Rustic
#+begin_src emacs-lisp
(use-package rustic
  :config
  ; Tell rustic where to find the cargo binary
  (setq rustic-cargo-bin-remote "/usr/local/cargo/bin/cargo")
  (setq rustic-lsp-client 'eglot))
#+end_src

* LSP Mode
#+begin_src emacs-lisp
;; (use-package lsp-mode
;;   :ensure t
;;   :commands lsp lsp-deferred
;;   :hook (;; hooks for all modes for which I want to setup lsp
;;          (python-mode . lsp)
;;          ;; which-key integration
;;          (lsp-mode . lsp-enable-which-key-integration))
;;   :config
;;   (progn
;;     (add-hook 'prog-mode-hook #'lsp)
;;     (lsp-register-client
;;      (make-lsp-client :new-connection (lsp-tramp-connection "/opt/conda/bin/pyls")
;;                       :major-modes '(python-mode)
;;                       :remote? t
;;                       :server-id 'pyls-remote))))
#+end_src

* Minites or RSpec
Do you use minitest instead or rspec
#+begin_src emacs-lisp
;; (use-minitest "_test")
#+end_src

* Solargraph or Sorbet
Use sorbet instead solargraph?
#+begin_src emacs-lisp
;; (after! lsp-mode
;;   (setq lsp-disabled-clients '(ruby-ls solargraph))
;;   (setq lsp-sorbet-use-bundler t))
#+end_src

* Warnings level
Stop some boring warnings
#+begin_src emacs-lisp
(setq warning-minimum-level :emergency)
#+end_src

* Projectile Magit
Start projectile with magit, uncomment below:
#+begin_src emacs-lisp
(after! projectile
  (defun open-projectile-with-magit (&optional DIRECTORY CACHE)
    (interactive)
    (magit-status DIRECTORY)
    (if (fboundp 'magit-fetch-from-upstream)
        (call-interactively #'magit-fetch-from-upstream)
      (call-interactively #'magit-fetch-current)))
  (setq +workspaces-switch-project-function #'open-projectile-with-magit))
#+end_src

Build your own file switches here
#+begin_src emacs-lisp
;; (after! projectile-rails
;;   ;; Example: switch from app/contracts/{resource}.rb to app/services/{resource} and vice-versa
;;   (defun projectile-rails-find-contract ()
;;     "Switch from contract to service and vice versa."
;;     (interactive)
;;     (if (string-match-p "app/contracts" (buffer-file-name)) (find-file (replace-regexp-in-string "contract" "service" (replace-regexp-in-string "_contracts" "_services" (buffer-file-name))))
;;       (find-file (replace-regexp-in-string "service" "contract" (replace-regexp-in-string "_services" "_contracts" (buffer-file-name))))))
;;   (map! :leader "rQ" #'projectile-rails-find-contract) ;; Uncomment to bind to SPC r q
;;   )
#+end_src

* Docker
** Want to use DOCKER?
If you want to use Docker first, configure you docker variables:
#+begin_src emacs-lisp
;; (load (expand-file-name "modules/docker.el" doom-user-dir))

;; (setq ruby-docker-compose-command "docker-compose") ;; You docker-compose command (tip: you can use "cd ../; docker-compose")
;; (setq ruby-docker-rails-server-command "up") ;' To start rails server with SPC r R (docker-compose is implicit)
;; (setq ruby-docker-rails-console-command "run {{container}} rails console") ;; to start rails console (docker-compose is implicit)

;; (setq ruby-docker-rubocop-command "run {{container}} rubocop -a ") ;; Command to run rubocop on current file with SPC =
;; (setq ruby-docker-compose-cwd "/app/")
;; (setq ruby-docker-compose-container "web")
#+end_src

** Ruby and Docker
#+begin_src emacs-lisp
;; Tip here:  You can use M-x rbenv-use and select one version that has solargraph.  You can also install with apt or brew.
;; (setq ruby-docker-disable-solargraph nil) ;; If you want to disable solargraph, change to t.  PS:  You can use solargraph by removing .ruby-version of your project and using from rbenv.
;; (use-ruby-docker)
;;
;; End Docker
#+end_src

** Javascript
Change Javascript autoformat
#+begin_src emacs-lisp
(setq-hook! 'rjsx-mode-hook +format-with 'prettier)
(setq-hook! 'typescript-tsx-mode-hook +format-with 'prettier)
(setq-hook! 'typescript-mode-hook +format-with 'prettier)
#+end_src

* Dired and Peep Dired
** Dired mode map
#+begin_src emacs-lisp
;; (map! :leader
;;       ;; (:prefix ("d" . "dired")
;;       ;;  :desc "Open dired" "d" #'dired
;;       ;;  :desc "Dired jump to current" "j" #'dired-jump)
;;       (:after dired
;;        (:map dired-mode-map
;;         :desc "Peep-dired image previews" "f v" #'peep-dired
;;         :desc "Dired view file" "f V" #'dired-view-file)))

(evil-define-key 'normal dired-mode-map
  (kbd "M-RET") 'dired-display-file
  (kbd "h") 'dired-up-directory
  (kbd "l") 'dired-open-file ; use dired-find-file instead of dired-open.
  (kbd "m") 'dired-mark
  (kbd "t") 'dired-toggle-marks
  (kbd "u") 'dired-unmark
  (kbd "C") 'dired-do-copy
  (kbd "D") 'dired-do-delete
  (kbd "J") 'dired-goto-file
  (kbd "M") 'dired-do-chmod
  (kbd "O") 'dired-do-chown
  (kbd "P") 'dired-do-print
  (kbd "R") 'dired-do-rename
  (kbd "T") 'dired-do-touch
  (kbd "Y") 'dired-copy-filenamecopy-filename-as-kill ; copies filename to kill ring.
  (kbd "+") 'dired-create-directory
  (kbd "-") 'dired-up-directory
  (kbd "% l") 'dired-downcase
  (kbd "% u") 'dired-upcase
  (kbd "; d") 'epa-dired-do-decrypt
  (kbd "; e") 'epa-dired-do-encrypt)
#+end_src

** Icons in Dired
Get file icons in dired
With dired-open plugin, you can launch external programs for certain extensions
For example, I set all .png files to open in 'sxiv' and all .mp4 files to open in 'mpv'
#+begin_src emacs-lisp
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
(setq dired-open-extensions '(("gif" . "sxiv")
                              ("jpg" . "sxiv")
                              ("png" . "sxiv")
                              ("mkv" . "mpv")
                              ("mp4" . "mpv")))
#+end_src

** Peep dired mode map
#+begin_src emacs-lisp
(evil-define-key 'normal peep-dired-mode-map
  (kbd "j") 'peep-dired-next-file
  (kbd "k") 'peep-dired-prev-file)
(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
#+end_src

* ORG
Everything related with Org.
** Org file location
If you use `org' and don't want your org files in the default location below, change `org-directory'. It must be set before org loads!
#+begin_src emacs-lisp
(after! org
  (setq org-directory "~/org/")
  (setq org-agenda-files '("~/org/agenda.org"))
  (setq org-log-done 'time )
  (setq org-log-done 'note )
  )

#+end_src

